In [1]:
import pandas as pd
import numpy as np

from pandas import DataFrame, Series

In [2]:
data = Series(['one','two', np.nan , 'four'])

In [3]:
data

0     one
1     two
2     NaN
3    four
dtype: object

In [4]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
data.dropna()

0     one
1     two
3    four
dtype: object

In [22]:
dframe = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9], [np.nan,np.nan,np.nan]])

dframe

In [23]:
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [27]:
clean_dframe = dframe.dropna(how = 'all') # is to be used to remove only null values. reemaining data will be there

#clean_dframe = dframe.dropna() is to be used to remove all rows having atleast 1 null values

In [28]:
clean_dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [29]:
dframe.dropna(axis = 1) #To remove columns containing null value

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [31]:
npn = np.nan

dframe2 = DataFrame([[1,2,3,npn], [2,npn,5,6],[npn,7,npn,9],[1,npn,npn,npn]])

##

dframe2

In [32]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [33]:
dframe2.dropna(thresh = 2) # rows having at least 2 non null values will be printed

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [35]:
dframe2.dropna(thresh = 3) #rows having at least 3 non null values will be printed

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0

In [36]:
dframe2.fillna(2) #null values are replaced with 2

     0    1    2    3
0  1.0  2.0  3.0  2.0
1  2.0  2.0  5.0  6.0
2  2.0  7.0  2.0  9.0
3  1.0  2.0  2.0  2.0

In [37]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [38]:
dframe2.fillna({0:0,1:1,2:2,3:3})

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  5.0  6.0
2  0.0  7.0  2.0  9.0
3  1.0  1.0  2.0  3.0